20250902T214644--kdoc-442-メモリエイリアシング検出と対策の例を見る__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T18:42:33Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 442: メモリエイリアシング検出と対策の例を見る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 442: メモリエイリアシング検出と対策の例を見る</h1>
<div id="outline-container-org168e673" class="outline-2">
<h2 id="org168e673"><a href="#org168e673">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org168e673">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-09-22 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-09-22 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb9ea8f0" class="outline-2">
<h2 id="orgb9ea8f0"><a href="#orgb9ea8f0">概要</a></h2>
<div class="outline-text-2" id="text-orgb9ea8f0">
<p>
メモリエイリアシングとは、異なる変数や参照が同じメモリ領域を指している状態を指す。メモリの効率使用に寄与するが、バグの原因になる可能性もある。
</p>

<p>
<a href="https://github.com/golang/go/commit/c7cf56bec994c6888be89c7c8f8a1911fb266ca8">big: handle aliasing correctly for Rat.SetFrac. · golang/go@c7cf56b</a>では、メモリエイリアシング検出と、検出した場合のコピーを実装している。
</p>

<div class="org-src-container">
<pre class="src src-diff"><span class="org-diff-context"> // SetFrac sets z to a/b and returns z.
 func (z *Rat) SetFrac(a, b *Int) *Rat {
</span><span class="org-diff-indicator-removed">-</span><span class="org-diff-removed">       z.a.Set(a)
</span><span class="org-diff-context">        z.a.neg = a.neg != b.neg
</span><span class="org-diff-indicator-removed">-</span><span class="org-diff-removed">       z.b = z.b.set(b.abs)
</span><span class="org-diff-indicator-added">+</span><span class="org-diff-added">       babs := b.abs
</span><span class="org-diff-indicator-added">+</span><span class="org-diff-added">       if &amp;z.a == b || alias(z.a.abs, babs) {
</span><span class="org-diff-indicator-added">+</span><span class="org-diff-added">               babs = nat(nil).set(babs) // make a copy
</span><span class="org-diff-indicator-added">+</span><span class="org-diff-added">       }
</span><span class="org-diff-indicator-added">+</span><span class="org-diff-added">       z.a.abs = z.a.abs.set(a.abs)
</span><span class="org-diff-indicator-added">+</span><span class="org-diff-added">       z.b = z.b.set(babs)
</span><span class="org-diff-context">        return z.norm()
</span> }
</pre>
</div>

<ul class="org-ul">
<li><code>&amp;z.a == b</code> 直接ポインタを比較する</li>
<li><code>alias(z.a.abs, babs)</code> 基底配列が同じでないか確認する</li>
</ul>
</div>
</div>
<div id="outline-container-org22e24d6" class="outline-2">
<h2 id="org22e24d6"><a href="#org22e24d6">関連</a></h2>
<div class="outline-text-2" id="text-org22e24d6">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
